Revit 2024 API
BuiltInFailures.OpeningFailures.HostForCutHasNoGeometryWarn Property
 Host can't be cut because it has no geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HostForCutHasNoGeometryWarn { get; }
Visual Basic
Public Shared ReadOnly Property HostForCutHasNoGeometryWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HostForCutHasNoGeometryWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace